# Taps
tap "argoproj/tap"
tap "derailed/k9s"
tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "d12frosted/emacs-plus"
tap "homebrew/cask-fonts"

cask_args appdir: "/Applications"

# Homebrew
brew "antibody"
brew "awscli"
brew "httpie"
brew "erlang"
brew "emacs-plus", args: ['--head']
brew "git"
brew "helm"
brew "fnm"
brew "jq"
brew "neovim"
brew "markdown"
brew "macvim"
brew "mas"
brew "nmap"
brew "node"
brew "pipenv"
brew "swi-prolog"
brew "wget"
brew "yarn"
brew "tmux"
brew "terminal-notifier"
brew "starship"

# Homebrew Casks
cask "arq"
cask "dash"
# cask "docker"
# cask "firefox"
cask "font-firacode-nerd-font"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "gpg-suite"
# cask "hazel"
cask "hammerspoon"
cask "imageoptim"
cask "iterm2"
cask "kaleidoscope"
# cask "notion"
# cask "slack"
cask "spotify"
cask "transmit"
cask "visual-studio-code"
cask "emacs-plus"

# Fonts
cask "font-anonymous-pro"
cask "font-fontawesome"
cask "font-hack-nerd-font"
cask "font-sourcecodepro-nerd-font"

# macOS App Store
#mas "1Blocker", id: 1107421413
mas "1Password 7", id: 1333542190
# mas "XCode", id: 497799835
# mas " Affinity Designer", id: 824171161
# mas "Affinity Photo", id: 824183456
# mas "Amphetamine", id: 937984704
#mas "Irvue", id: 1039633667
#mas "Jira", id: 1475897096
#mas "Microsoft Remote Desktop", id: 1295203466
# mas "Parcel", id: 639968404
# mas "Reeder", id: 880001334
# mas "Things", id: 904280696
