# Taps
tap "argoproj/tap"
tap "derailed/k9s"
tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Homebrew
brew "antibody"
brew "awscli"
brew "httpie"
brew "erlang"
brew "argocd"
brew "black"
brew "docker-machine-driver-vmware"
brew "docker-machine"
brew "fish"
brew "git"
brew "go"
brew "grc"
brew "helm"
brew "httpie"
brew "jq"
brew "k9s"
brew "neovim"
brew "markdown"
brew "macvim"
brew "kubectx"
brew "kubernetes-cli"
brew "mas"
brew "minikube"
brew "nmap"
brew "node"
brew "pipenv"
brew "pyenv"
brew "watch"
brew "wget"
brew "wrk"
brew "yamllint"
brew "yarn"
brew "tmux"

# Homebrew Casks
cask "arq"
cask "audirvana"
cask "coconutbattery"
cask "dash"
cask "docker"
cask "firefox"
cask "firefox-developer-edition"
cask "font-firacode-nerd-font"
cask "font-jetbrains-mono"
cask "gitkraken"
cask "gpg-suite"
cask "hazel"
cask "hammerspoon"
cask "iina"
cask "imageoptim"
cask "intel-power-gadget"
cask "iterm2"
cask "kaleidoscope"
cask "keka"
cask "kubecontext"
cask "launchbar"
cask "ledger-live"
cask "notion"
cask "pock"
cask "pycharm"
cask "royal-tsx"
cask "safarisort"
cask "sequential"
cask "slack"
cask "spotify"
cask "transmit"
cask "visual-studio-code"

# macOS App Store
#mas "1Blocker", id: 1107421413
# mas "1Password 7", id: 1333542190
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
# mas "Amphetamine", id: 937984704
#mas "Irvue", id: 1039633667
#mas "Jira", id: 1475897096
#mas "Microsoft Remote Desktop", id: 1295203466
# mas "Parcel", id: 639968404
mas "Reeder", id: 880001334
mas "Things", id: 904280696
