# Taps
tap "argoproj/tap"
tap "derailed/k9s"
tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/cask-fonts"

cask_args appdir: "/Applications"

# Homebrew
brew "antibody"
brew "awscli"
brew "httpie"
brew "erlang"
brew "git"
brew "helm"
brew "fnm"
brew "jq"
brew "coreutils"
brew "fontconfig"
brew "ranger"
brew "vale"
brew "neovim"
brew "markdown"
brew "macvim"
brew "mas"
brew "nmap"
brew "node"
brew "pipenv"
brew "swi-prolog"
brew "wget"
brew "yarn"
brew "tmux"
brew "terminal-notifier"
brew "starship"
brew "emacs-head@28 --with-cocoa --with-native-comp --with-native-full-aot --with-modern-icon-doom-cacodemon"
brew "michaeldfallen/formula/git-radar"
brew "zsh-history-substring-search"
brew "tldr"
brew "htop"
brew "tree"
brew "fzf"
brew "fd"
brew "bat"
brew "direnv"
brew "ripgrep"
brew "path-extractor"
brew "go"
brew "ant"
brew "maven"
brew "gradle"
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
brew "chiclick"
brew "gh"
brew "latexindent"
brew "font-gentium-plus"
brew "font-tex-gyre-pagella"
brew "font-tex-gyre-pagella-math"
# Homebrew Casks
cask "arq"
cask "dash"
# cask "android-sdk"
# cask "android-ndk"
cask "android-studio"
# cask "docker"
# cask "firefox"
# cask "font-firacode-nerd-font"
# cask "font-fira-code"
# cask "font-jetbrains-mono"
cask "mactex"
cask "skim"

cask "font-consolas-for-powerline"
cask "font-fira-code"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"
cask "hyper"
cask "gpg-suite"
# cask "hazel"
cask "hammerspoon"
cask "imageoptim"
cask "iterm2"
cask "kaleidoscope"
cask "rectangle"
cask "licecap"
cask "numi"
# cask "notion"
# cask "slack"
# cask "spotify"
# cask "transmit"
cask "visual-studio-code"

# macOS App Store
